In [1]:
#Importing Libraries 
import pandas as pd
import openpyxl

# Analysing the Dataset

In [2]:
dataset = pd.read_excel('Titanic data.xlsx')

In [3]:
#Checking the dataset 
dataset

,pclass,survived,name,Unnamed: 3,sex,age,sibsp,parch,ticket,fare,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",NaN,female,29.0000,0,0,24160,211.3375,S
1,1,1,"Allison, Master. Hudson Trevor",NaN,male,0.9167,1,2,113781,151.5500,S
2,1,0,"Allison, Miss. Helen Loraine",NaN,female,2.0000,1,2,113781,151.5500,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",NaN,male,30.0000,1,2,113781,151.5500,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",NaN,female,25.0000,1,2,113781,151.5500,S
...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",NaN,female,14.5000,1,0,2665,14.4542,C
1305,3,0,"Zabour, Miss. Thamine",NaN,female,NaN,1,0,2665,14.4542,C
1306,3,0,"Zakarian, Mr. Mapriededer",NaN,male,26.5000,0,0,2656,7.2250,C
1307,3,0,"Zakarian, Mr. Ortin",NaN,male,27.0000,0,0,2670,7.2250,C
1308,3,0,"Zimmerman, Mr. Leo",NaN,male,29.0000,0,0,315082,7.8750,S

In [4]:
#checking duplicates
duplicates = dataset.duplicated()
duplicates

0       False
1       False
2       False
3       False
4       False
        ...
1304    False
1305    False
1306    False
1307    False
1308    False
Length: 1309, dtype: bool

In [5]:
duplicates.sum()

0

In [6]:
# To find the columns Names
dataset.columns

Index(['pclass', 'survived', 'name', 'Unnamed: 3', 'sex', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'embarked'],
      dtype='object')

In [7]:
# Removing the clolumns
data = dataset.drop(['Unnamed: 3'], axis=1)

In [8]:
data

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,S
...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,C
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,C
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,C
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,C
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,S

In [9]:
# Checking the data types
data.dtypes

pclass        int64
survived      int64
name         object
sex          object
age         float64
sibsp         int64
parch         int64
ticket       object
fare        float64
embarked     object
dtype: object

In [10]:
data["age"].value_counts()

24.0000    47
22.0000    43
21.0000    41
30.0000    40
18.0000    39
           ..
0.3333      1
22.5000     1
70.5000     1
0.6667      1
26.5000     1
Name: age, Length: 98, dtype: int64

In [11]:
data.isnull().sum()

pclass        0
survived      0
name          0
sex           0
age         263
sibsp         0
parch         0
ticket        0
fare          1
embarked      2
dtype: int64

In [12]:
#statistics of the dataset
data.describe()

,pclass,survived,age,sibsp,parch,fare
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200

# Data cleaning

In [13]:
data["name"].value_counts()

Connolly, Miss. Kate             2
Kelly, Mr. James                 2
Allen, Miss. Elisabeth Walton    1
Ilmakangas, Miss. Ida Livija     1
Ilieff, Mr. Ylio                 1
                                ..
Hart, Miss. Eva Miriam           1
Harris, Mr. Walter               1
Harris, Mr. George               1
Harper, Rev. John                1
Zimmerman, Mr. Leo               1
Name: name, Length: 1307, dtype: int64

In [14]:
data["name"][0]

'Allen, Miss. Elisabeth Walton'

In [15]:
#split the 'name' column to extract the part after the coma
data['name_split'] = data['name'].apply(lambda x: x.split(','))
print(data['name_split'])

0                        [Allen,  Miss. Elisabeth Walton]
1                       [Allison,  Master. Hudson Trevor]
2                         [Allison,  Miss. Helen Loraine]
3                 [Allison,  Mr. Hudson Joshua Creighton]
4       [Allison,  Mrs. Hudson J C (Bessie Waldo Danie...
                              ...
1304                              [Zabour,  Miss. Hileni]
1305                             [Zabour,  Miss. Thamine]
1306                         [Zakarian,  Mr. Mapriededer]
1307                               [Zakarian,  Mr. Ortin]
1308                                [Zimmerman,  Mr. Leo]
Name: name_split, Length: 1309, dtype: object

In [16]:
data['name_split'] = data['name'].apply(lambda x: x.split(',')[1])
print(data['name_split'])

0                        Miss. Elisabeth Walton
1                         Master. Hudson Trevor
2                           Miss. Helen Loraine
3                   Mr. Hudson Joshua Creighton
4        Mrs. Hudson J C (Bessie Waldo Daniels)
                         ...
1304                               Miss. Hileni
1305                              Miss. Thamine
1306                            Mr. Mapriededer
1307                                  Mr. Ortin
1308                                    Mr. Leo
Name: name_split, Length: 1309, dtype: object

In [17]:
#split the extracted part to get the courtesy title and remove any leading /trailing spaces
data['courtesy_title'] = data['name_split'].apply(lambda x: x.split('.')[0].strip())
print(data['courtesy_title'])

0         Miss
1       Master
2         Miss
3           Mr
4          Mrs
         ...
1304      Miss
1305      Miss
1306        Mr
1307        Mr
1308        Mr
Name: courtesy_title, Length: 1309, dtype: object

In [18]:
data['courtesy_title'].value_counts()

Mr              757
Miss            260
Mrs             197
Master           61
Rev               8
Dr                8
Col               4
Mlle              2
Ms                2
Major             2
Capt              1
Sir               1
Dona              1
Jonkheer          1
the Countess      1
Don               1
Mme               1
Lady              1
Name: courtesy_title, dtype: int64

# Extracted courtesy titles
Mr             
Miss            
Mrs             
Master           
Rev             
Dr            
Col            
Mlle             
Ms               
Major            
Capt             
Sir              
Dona            
Jonkheer          
the Countess      
Don               
Mme              
Lady

In [19]:
#Title Mapping
title_mapping = {'Mr': 'Mr',
'Mrs': 'Mrs',
'Miss': 'Miss',
'Master': 'Master',
'Dr': 'Mr',
'Rev': 'Mr',
'Col': 'Mr',
'Mlle': 'Miss',
'Ms': 'Miss',
'Major': 'Mr',
'Capt': 'Mr',
'Sir': 'Mr',
'Dona': 'Mrs',
'Jonkheer': 'Mr',
'the Countess': 'Mrs',
'Don': 'Mr',
'Mme': 'Mrs',
'Lady':'Mrs'}

In [20]:
# Applying the mapping
data['courtesy_title'] = data['courtesy_title'].map(title_mapping)

In [21]:
data['courtesy_title'].value_counts()

Mr        783
Miss      264
Mrs       201
Master     61
Name: courtesy_title, dtype: int64

In [22]:
# Find the mean values of 'age' group by 'Title'
mean_age_by_title = data.groupby(['courtesy_title']).age.mean()

In [23]:
def fill_age(row):
    if pd.isnull(row['age']):
        return mean_age_by_title[row['courtesy_title']]
    else:
        return row['age']

In [24]:
data['age'] = data.apply(fill_age, axis=1)

In [25]:
data.isnull().sum()

pclass            0
survived          0
name              0
sex               0
age               0
sibsp             0
parch             0
ticket            0
fare              1
embarked          2
name_split        0
courtesy_title    0
dtype: int64

In [26]:
# Fill the missing values with mode in "Embarked"
data['embarked'].fillna(data['embarked'].mode()[0],inplace = True)

In [27]:
# Fill the missing values with median in "fare"
data['fare'].fillna(data['fare'].median(),inplace = True)

In [28]:
data.isnull().sum()

pclass            0
survived          0
name              0
sex               0
age               0
sibsp             0
parch             0
ticket            0
fare              0
embarked          0
name_split        0
courtesy_title    0
dtype: int64

In [29]:
data

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked,name_split,courtesy_title
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.000000,0,0,24160,211.3375,S,Miss. Elisabeth Walton,Miss
1,1,1,"Allison, Master. Hudson Trevor",male,0.916700,1,2,113781,151.5500,S,Master. Hudson Trevor,Master
2,1,0,"Allison, Miss. Helen Loraine",female,2.000000,1,2,113781,151.5500,S,Miss. Helen Loraine,Miss
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.000000,1,2,113781,151.5500,S,Mr. Hudson Joshua Creighton,Mr
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.000000,1,2,113781,151.5500,S,Mrs. Hudson J C (Bessie Waldo Daniels),Mrs
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.500000,1,0,2665,14.4542,C,Miss. Hileni,Miss
1305,3,0,"Zabour, Miss. Thamine",female,21.824335,1,0,2665,14.4542,C,Miss. Thamine,Miss
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.500000,0,0,2656,7.2250,C,Mr. Mapriededer,Mr
1307,3,0,"Zakarian, Mr. Ortin",male,27.000000,0,0,2670,7.2250,C,Mr. Ortin,Mr
1308,3,0,"Zimmerman, Mr. Leo",male,29.000000,0,0,315082,7.8750,S,Mr. Leo,Mr

In [30]:
# Create the new column 'ageGroup' using conditions
data['ageGroup'] = 'Unknown' # Default value
data.loc[data['age'] < 18, 'ageGroup'] = 'Young'
data.loc[(data['age'] >= 18) & (data['age'] <40), 'ageGroup'] = 'Adult'
data.loc[(data['age'] >= 40) & (data['age'] < 56), 'ageGroup'] = 'Middle age'
data.loc[data['age'] >= 56, 'ageGroup'] = 'Senior'
data

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked,name_split,courtesy_title,ageGroup
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.000000,0,0,24160,211.3375,S,Miss. Elisabeth Walton,Miss,Adult
1,1,1,"Allison, Master. Hudson Trevor",male,0.916700,1,2,113781,151.5500,S,Master. Hudson Trevor,Master,Young
2,1,0,"Allison, Miss. Helen Loraine",female,2.000000,1,2,113781,151.5500,S,Miss. Helen Loraine,Miss,Young
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.000000,1,2,113781,151.5500,S,Mr. Hudson Joshua Creighton,Mr,Adult
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.000000,1,2,113781,151.5500,S,Mrs. Hudson J C (Bessie Waldo Daniels),Mrs,Adult
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.500000,1,0,2665,14.4542,C,Miss. Hileni,Miss,Young
1305,3,0,"Zabour, Miss. Thamine",female,21.824335,1,0,2665,14.4542,C,Miss. Thamine,Miss,Adult
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.500000,0,0,2656,7.2250,C,Mr. Mapriededer,Mr,Adult
1307,3,0,"Zakarian, Mr. Ortin",male,27.000000,0,0,2670,7.2250,C,Mr. Ortin,Mr,Adult
1308,3,0,"Zimmerman, Mr. Leo",male,29.000000,0,0,315082,7.8750,S,Mr. Leo,Mr,Adult

# Insights in this Dataset

In [31]:
# Total Passenger Count
total_passenger_count = data.value_counts().sum()
print("Total Passenger Count:", total_passenger_count)

Total Passenger Count: 1309

In [32]:
# Count of Surviving Passengers
surviving_passengers_count = data['survived'].sum()
print("Count of Surviving Passengers:", surviving_passengers_count)

Count of Surviving Passengers: 500

In [33]:
# Count of Deceased Passengers
Deceased_passengers_count = (data['survived'] == 0).sum()
print("Count of Deceased Passengers:", Deceased_passengers_count)

Count of Deceased Passengers: 809

In [34]:
# Total Fare Collected
total_fare_collected = data['fare'].sum()
print("Total fare:" ,total_fare_collected )

Total fare: 43564.9411

In [35]:
# Gender-wise Classification
gender_classification = data['sex'].value_counts()
print(gender_classification)

male      843
female    466
Name: sex, dtype: int64

In [36]:
# Passenger Breakdown by Class
passenger_class_breakdown = data['pclass'].value_counts()
passenger_class_breakdown

3    709
1    323
2    277
Name: pclass, dtype: int64

In [37]:
# Survival and Mortality Rates
total_passengers = data.shape[0]
number_of_survivors = data['survived'].sum()
number_of_non_survivors = total_passengers - number_of_survivors

# Survival and mortality rates
survival_rate = (number_of_survivors / total_passengers) * 100
mortality_rate = (number_of_non_survivors / total_passengers) * 100

print(f"Total passengers: {total_passengers}")
print(f"Number of survivors: {number_of_survivors}")
print(f"Number of non-survivors: {number_of_non_survivors}")
print(f"Survival rate: {survival_rate:.2f}%")
print(f"Mortality rate: {mortality_rate:.2f}%")

Total passengers: 1309
Number of survivors: 500
Number of non-survivors: 809
Survival rate: 38.20%
Mortality rate: 61.80%

In [38]:
# Survival rates by gender
gender_survival_rate = data.groupby('sex')['survived'].mean() * 100

print("Survival Rate by Gender:")
print(gender_survival_rate)

Survival Rate by Gender:
sex
female    72.746781
male      19.098458
Name: survived, dtype: float64

In [39]:
# Mortality rates by gender
gender_mortality_rate = (1 - data.groupby('sex')['survived'].mean()) * 100

print("Mortality Rate by Gender:")
print(gender_mortality_rate)

Mortality Rate by Gender:
sex
female    27.253219
male      80.901542
Name: survived, dtype: float64

# Saving the Dataset into CSV File

In [40]:
# Save the cleaned DataFrame to a CSV File
data.to_csv('cleaned_data(task1).csv', index = False)